export const versionHistory = {
    'current': {
        'deploy_time': '2022-12-30',
        'version_no': 'v1.2.10',
        'content': [
            '1.内置定时可配置解锁合闸',
            '2.优化了808设备的相关功能',
            '3.完善了摄像头的云台控制',
            '4.优化了英文版的显示',
            '5.修复了一些已知的Bug'
        ]
    },
    'hislist': [
        {
            'deploy_time': '2022-11-25',
            'version_no': 'v1.2.8',
            'content': [
                '1.实现内置定时“分闸锁定”',
                '2.实现电量、电费配置和监控',
                '3.实现流量卡管理和监控',
                '4.实现摄像头设备接入',
                '5.实现设备图区配置',
                '6.实现808设备数据显示',
                '7.放开“断电恢复分闸保护”使能',
                '8.优化了报警声音',
                '9.修复了一些BUG'
            ]
        },
        {
            'deploy_time': '2022-11-04',
            'version_no': 'v1.2.7-sp1',
            'content': [
                '1.修复了一些BUG'
            ]
        },
        {
            'deploy_time': '2022-10-24',
            'version_no': 'v1.2.6',
            'content': [
                '1.实现自定义报警功能',
                '2.重构设备参数配置页面',
                '3.完善阈值配置的功能',
                '4.优化联动配置的功能',
                '5.修复了一些BUG'
            ]
        },
        {
            'deploy_time': '2022-9-20',
            'version_no': 'v1.2.5',
            'content': [
                '1.调整了阈值配置的方式',
                '2.修复了一些BUG'
            ]
        },
        {
            'deploy_time': '2022-9-14',
            'version_no': 'v1.2.2-sp1',
            'content': [
                '1.优化了部分界面的体验',
                '2.修复了一些BUG'
            ]
        },
        {
            'deploy_time': '2022-8-05',
            'version_no': 'v1.2.0',
            'content': [
                '1.增加面板类(H5系列)设备',
                '2.增加压力、液位、水浸的联动设备',
                '3.场景控制区分“自动”和“手动”',
                '4.实现了几个开放接口',
                '5.优化了部分界面的体验',
                '6.完善了一些缺失的功能',
                '7.修复了一些功能的BUG'
            ]
        },
        {
            'deploy_time': '2022-7-11',
            'version_no': 'v1.1.0',
            'content': [
                '1.优化了界面的体验',
                '2.修复了一些功能BUG',
                '3.完善了缺失的功能',
                '4.新增了部分需求'
            ]
        },
        {
            'deploy_time': '2022-5-31',
            'version_no': 'v1.0.4',
            'content': [
                '1.优化了界面的体验',
                '2.修复了一些功能BUG',
                '3.完善了缺失的功能'
            ]
        },
        {
            'deploy_time': '2022-5-19',
            'version_no': 'v1.0.3',
            'content': [
                '1.优化了界面的体验',
                '2.修复了一些功能BUG',
                '3.完善了缺失的功能'
            ]
        },
        {
            'deploy_time': '2022-5-10',
            'version_no': 'v1.0.2',
            'content': [
                '1.优化了界面的体验',
                '2.修复了一些功能BUG',
                '3.完善了缺失的功能'
            ]
        }, {
            'deploy_time': '2022-04-29',
            'version_no': 'v1.0.1',
            'content': [
                '1.修复了一些功能BUG',
                '2.优化了部分页面的体验'
            ]
        }, {
            'deploy_time': '2022-04-20',
            'version_no': 'v1.0.0',
            'content': [
                '开启全新的系统界面'
            ]
        }
    ]
}
